Repository: MatheoWecode/LICENSED_wepresta_passwordless_login
Catalog: translations/*/ModulesWeprestapasswordlessloginAdmin.*.xlf
Languages: es_es, fr_fr, it_it, pl_pl

source: Passwordless Login
es_es: Inicio de sesión sin contraseña
fr_fr: Connexion sans mot de passe
it_it: Accesso senza password
pl_pl: Logowanie bez hasła

source: Allow customers to sign in with email verification codes or Google Login instead of passwords.
es_es: Permite a los clientes iniciar sesión con códigos de verificación por email o Google Login en lugar de contraseñas.
fr_fr: Permettez aux clients de se connecter avec des codes de vérification par e-mail ou Google Login au lieu de mots de passe.
it_it: Permetti ai clienti di accedere con codici di verifica email o Google Login invece delle password.
pl_pl: Zezwalaj klientom na logowanie za pomocą kodów weryfikacyjnych email lub Google Login zamiast haseł.

source: Are you sure you want to uninstall? All verification codes and social login links will be deleted.
es_es: ¿Estás seguro de que quieres desinstalar? Todos los códigos de verificación y enlaces de inicio de sesión social serán eliminados.
fr_fr: Êtes-vous sûr de vouloir désinstaller ? Tous les codes de vérification et liens de connexion sociale seront supprimés.
it_it: Sei sicuro di voler disinstallare? Tutti i codici di verifica e i collegamenti di accesso social verranno eliminati.
pl_pl: Czy na pewno chcesz odinstalować? Wszystkie kody weryfikacyjne i linki logowania społecznościowego zostaną usunięte.

source: Settings saved.
es_es: Configuración guardada.
fr_fr: Paramètres enregistrés.
it_it: Impostazioni salvate.
pl_pl: Ustawienia zostały zapisane.

source: Google Client ID is required when Google Login is enabled.
es_es: El ID de cliente de Google es obligatorio cuando el inicio de sesión de Google está habilitado.
fr_fr: L'identifiant client Google est requis lorsque la connexion Google est activée.
it_it: L'ID client Google è richiesto quando l'accesso Google è abilitato.
pl_pl: ID klienta Google jest wymagane, gdy logowanie Google jest włączone.

source: Code expiration must be between 1 and 60 minutes.
es_es: La expiración del código debe estar entre 1 y 60 minutos.
fr_fr: L'expiration du code doit être comprise entre 1 et 60 minutes.
it_it: La scadenza del codice deve essere compresa tra 1 e 60 minuti.
pl_pl: Wygaśnięcie kodu musi wynosić od 1 do 60 minut.

source: Max attempts must be between 1 and 10.
es_es: El número máximo de intentos debe estar entre 1 y 10.
fr_fr: Le nombre maximum de tentatives doit être compris entre 1 et 10.
it_it: Il numero massimo di tentativi deve essere compreso tra 1 e 10.
pl_pl: Maksymalna liczba prób musi wynosić od 1 do 10.

source: General Settings
es_es: Configuración general
fr_fr: Paramètres généraux
it_it: Impostazioni generali
pl_pl: Ustawienia ogólne

source: Enable module
es_es: Habilitar módulo
fr_fr: Activer le module
it_it: Abilita modulo
pl_pl: Włącz moduł

source: Display shop logo
es_es: Mostrar logo de la tienda
fr_fr: Afficher le logo de la boutique
it_it: Visualizza logo negozio
pl_pl: Wyświetl logo sklepu

source: Show the shop logo on the login page.
es_es: Mostrar el logo de la tienda en la página de inicio de sesión.
fr_fr: Afficher le logo de la boutique sur la page de connexion.
it_it: Visualizza il logo del negozio nella pagina di accesso.
pl_pl: Pokaż logo sklepu na stronie logowania.

source: Show classic login link
es_es: Mostrar enlace de inicio de sesión clásico
fr_fr: Afficher le lien de connexion classique
it_it: Mostra collegamento accesso classico
pl_pl: Pokaż klasyczny link logowania

source: Display a "Sign in with a password" link on the passwordless login page, allowing customers to use the standard PrestaShop login form instead.
es_es: Muestra un enlace "Iniciar sesión con una contraseña" en la página de inicio de sesión sin contraseña, permitiendo a los clientes usar el formulario de inicio de sesión estándar de PrestaShop.
fr_fr: Affiche un lien « Se connecter avec un mot de passe » sur la page de connexion sans mot de passe, permettant aux clients d'utiliser le formulaire de connexion classique de PrestaShop.
it_it: Visualizza un collegamento "Accedi con una password" nella pagina di accesso senza password, permettendo ai clienti di utilizzare il modulo di accesso standard di PrestaShop.
pl_pl: Wyświetl link "Zaloguj się za pomocą hasła" na stronie logowania bez hasła, umożliwiając klientom użycie standardowego formularza logowania PrestaShop.

source: Debug mode
es_es: Modo de depuración
fr_fr: Mode debug
it_it: Modalità debug
pl_pl: Tryb debugowania

source: Enable logging for troubleshooting. Logs are written to PrestaShop's log system.
es_es: Habilitar registro para resolución de problemas. Los registros se escriben en el sistema de registros de PrestaShop.
fr_fr: Activer les logs pour le dépannage. Les logs sont écrits dans le système de logs de PrestaShop.
it_it: Abilita il logging per la risoluzione dei problemi. I log vengono scritti nel sistema di log di PrestaShop.
pl_pl: Włącz rejestrowanie do rozwiązywania problemów. Logi są zapisywane w systemie logów PrestaShop.

source: Disable guest checkout
es_es: Deshabilitar pago como invitado
fr_fr: Désactiver la commande en tant qu'invité
it_it: Disabilita checkout ospite
pl_pl: Wyłącz płatność gościa

source: Warning: Guest checkout will be disabled. Customers will need to sign in to place an order.
es_es: Advertencia: El pago como invitado será deshabilitado. Los clientes necesitarán iniciar sesión para realizar un pedido.
fr_fr: Attention : la commande en tant qu'invité sera désactivée. Les clients devront se connecter pour passer une commande.
it_it: Avviso: il checkout ospite verrà disabilitato. I clienti dovranno accedere per effettuare un ordine.
pl_pl: Ostrzeżenie: Płatność gościa zostanie wyłączona. Klienci będą musieli się zalogować, aby złożyć zamówienie.

source: Google Login
es_es: Inicio de sesión de Google
fr_fr: Connexion Google
it_it: Accesso Google
pl_pl: Logowanie Google

source: Enable Google Login
es_es: Habilitar inicio de sesión de Google
fr_fr: Activer la connexion Google
it_it: Abilita accesso Google
pl_pl: Włącz logowanie Google

source: Google Client ID
es_es: ID de cliente de Google
fr_fr: Identifiant client Google
it_it: ID client Google
pl_pl: ID klienta Google

source: How to get a Google Client ID:
es_es: Cómo obtener un ID de cliente de Google:
fr_fr: Comment obtenir un identifiant client Google :
it_it: Come ottenere un ID client Google:
pl_pl: Jak uzyskać ID klienta Google:

source: Go to [url]console.cloud.google.com[/url] and create a project (or select an existing one)
es_es: Ve a [url]console.cloud.google.com[/url] y crea un proyecto (o selecciona uno existente)
fr_fr: Allez sur [url]console.cloud.google.com[/url] et créez un projet (ou sélectionnez-en un existant)
it_it: Vai su [url]console.cloud.google.com[/url] e crea un progetto (o selezionane uno esistente)
pl_pl: Przejdź do [url]console.cloud.google.com[/url] i utwórz projekt (lub wybierz istniejący)

source: Go to "APIs & Services" > "Credentials"
es_es: Ve a "APIs y servicios" > "Credenciales"
fr_fr: Allez dans « API et services » > « Identifiants »
it_it: Vai su "API e servizi" > "Credenziali"
pl_pl: Przejdź do "API i usługi" > "Poświadczenia"

source: Click "Create Credentials" > "OAuth client ID"
es_es: Haz clic en "Crear credenciales" > "ID de cliente OAuth"
fr_fr: Cliquez sur « Créer des identifiants » > « ID client OAuth »
it_it: Clicca "Crea credenziali" > "ID client OAuth"
pl_pl: Kliknij "Utwórz poświadczenia" > "ID klienta OAuth"

source: If prompted, configure the OAuth consent screen first (User type: External)
es_es: Si se solicita, configura primero la pantalla de consentimiento OAuth (Tipo de usuario: Externo)
fr_fr: Si demandé, configurez d'abord l'écran de consentement OAuth (Type d'utilisateur : Externe)
it_it: Se richiesto, configura prima la schermata di consenso OAuth (Tipo utente: Esterno)
pl_pl: Jeśli zostaniesz poproszony, najpierw skonfiguruj ekran zgody OAuth (Typ użytkownika: Zewnętrzny)

source: Application type: "Web application"
es_es: Tipo de aplicación: "Aplicación web"
fr_fr: Type d'application : « Application Web »
it_it: Tipo applicazione: "Applicazione web"
pl_pl: Typ aplikacji: "Aplikacja internetowa"

source: In "Authorized JavaScript origins", add your domain (e.g. https://yourshop.com)
es_es: En "Orígenes de JavaScript autorizados", agrega tu dominio (ej. https://tutienda.com)
fr_fr: Dans « Origines JavaScript autorisées », ajoutez votre domaine (ex : https://votreboutique.com)
it_it: In "Origini JavaScript autorizzate", aggiungi il tuo dominio (es. https://tuonegozio.com)
pl_pl: W "Autoryzowanych źródłach JavaScript", dodaj swoją domenę (np. https://twójsklep.com)

source: Copy the Client ID and paste it here
es_es: Copia el ID de cliente y pégalo aquí
fr_fr: Copiez l'identifiant client et collez-le ici
it_it: Copia l'ID client e incollalo qui
pl_pl: Skopiuj ID klienta i wklej tutaj

source: Security Settings
es_es: Configuración de seguridad
fr_fr: Paramètres de sécurité
it_it: Impostazioni di sicurezza
pl_pl: Ustawienia bezpieczeństwa

source: Code expiration (minutes)
es_es: Expiración del código (minutos)
fr_fr: Expiration du code (minutes)
it_it: Scadenza codice (minuti)
pl_pl: Wygaśnięcie kodu (minuty)

source: Max attempts per code
es_es: Máximo de intentos por código
fr_fr: Tentatives max par code
it_it: Tentativi massimi per codice
pl_pl: Maksymalna liczba prób na kod

source: Max codes per email per hour
es_es: Máximo de códigos por email por hora
fr_fr: Codes max par e-mail par heure
it_it: Codici massimi per email all'ora
pl_pl: Maksymalna liczba kodów na email na godzinę

source: Resend countdown (seconds)
es_es: Cuenta regresiva de reenvío (segundos)
fr_fr: Délai de renvoi (secondes)
it_it: Conto alla rovescia reinvio (secondi)
pl_pl: Odliczanie ponownego wysłania (sekundy)

source: Hide native login link
es_es: Ocultar enlace de inicio de sesión nativo
fr_fr: Masquer le lien de connexion natif
it_it: Nascondi collegamento accesso nativo
pl_pl: Ukryj natywny link logowania

source: Hide the default PrestaShop "Sign in" link (from ps_customersignin) for guests. The account/logout links remain visible for logged-in customers.
es_es: Ocultar el enlace "Iniciar sesión" predeterminado de PrestaShop (de ps_customersignin) para invitados. Los enlaces de cuenta/cerrar sesión permanecen visibles para clientes conectados.
fr_fr: Masquer le lien « Se connecter » par défaut de PrestaShop (ps_customersignin) pour les visiteurs. Les liens compte/déconnexion restent visibles pour les clients connectés.
it_it: Nascondi il collegamento "Accedi" predefinito di PrestaShop (da ps_customersignin) per gli ospiti. I collegamenti account/disconnetti rimangono visibili per i clienti connessi.
pl_pl: Ukryj domyślny link "Zaloguj się" PrestaShop (z ps_customersignin) dla gości. Linki konta/wylogowania pozostają widoczne dla zalogowanych klientów.

source: Login link position
es_es: Posición del enlace de inicio de sesión
fr_fr: Position du lien de connexion
it_it: Posizione collegamento accesso
pl_pl: Pozycja linku logowania

source: Choose where to display the login link in your theme.
es_es: Elige dónde mostrar el enlace de inicio de sesión en tu tema.
fr_fr: Choisissez où afficher le lien de connexion dans votre thème.
it_it: Scegli dove visualizzare il collegamento di accesso nel tuo tema.
pl_pl: Wybierz, gdzie wyświetlić link logowania w swoim motywie.

source: Navigation bar (left)
es_es: Barra de navegación (izquierda)
fr_fr: Barre de navigation (gauche)
it_it: Barra di navigazione (sinistra)
pl_pl: Pasek nawigacyjny (lewa strona)

source: Navigation bar (right)
es_es: Barra de navegación (derecha)
fr_fr: Barre de navigation (droite)
it_it: Barra di navigazione (destra)
pl_pl: Pasek nawigacyjny (prawa strona)

source: Top of the page
es_es: Parte superior de la página
fr_fr: Haut de la page
it_it: In alto nella pagina
pl_pl: Góra strony

source: Full-width navigation
es_es: Navegación de ancho completo
fr_fr: Navigation pleine largeur
it_it: Navigazione a larghezza piena
pl_pl: Nawigacja pełnej szerokości

source: Custom hook
es_es: Hook personalizado
fr_fr: Hook personnalisé
it_it: Hook personalizzato
pl_pl: Własny hook

source: Custom hook name
es_es: Nombre del hook personalizado
fr_fr: Nom du hook personnalisé
it_it: Nome hook personalizzato
pl_pl: Nazwa własnego hooka

source: Enter the hook name provided by your theme (e.g. displayCustomNav). Only used when "Custom hook" is selected above.
es_es: Ingresa el nombre del hook proporcionado por tu tema (ej. displayCustomNav). Solo se usa cuando "Hook personalizado" está seleccionado arriba.
fr_fr: Entrez le nom du hook fourni par votre thème (ex : displayCustomNav). Utilisé uniquement lorsque « Hook personnalisé » est sélectionné ci-dessus.
it_it: Inserisci il nome dell'hook fornito dal tuo tema (es. displayCustomNav). Utilizzato solo quando è selezionato "Hook personalizzato" sopra.
pl_pl: Wprowadź nazwę hooka dostarczoną przez Twój motyw (np. displayCustomNav). Używane tylko gdy "Własny hook" jest wybrany powyżej.

source: Custom hook name is required when "Custom hook" is selected.
es_es: El nombre del hook personalizado es obligatorio cuando "Hook personalizado" está seleccionado.
fr_fr: Le nom du hook personnalisé est requis lorsque « Hook personnalisé » est sélectionné.
it_it: Il nome dell'hook personalizzato è richiesto quando è selezionato "Hook personalizzato".
pl_pl: Nazwa własnego hooka jest wymagana, gdy "Własny hook" jest wybrany.

source: Custom hook name must contain only letters and numbers, and start with a letter.
es_es: El nombre del hook personalizado debe contener solo letras y números, y comenzar con una letra.
fr_fr: Le nom du hook personnalisé ne doit contenir que des lettres et des chiffres, et commencer par une lettre.
it_it: Il nome dell'hook personalizzato deve contenere solo lettere e numeri, e iniziare con una lettera.
pl_pl: Nazwa własnego hooka może zawierać tylko litery i cyfry, i musi zaczynać się od litery.

source: Note: If your theme uses a custom login template (not the default ps_customersignin), this option may not work as expected.
es_es: Nota: Si tu tema usa una plantilla de inicio de sesión personalizada (no la predeterminada ps_customersignin), esta opción puede no funcionar como se esperaba.
fr_fr: Note : Si votre thème utilise un template de connexion personnalisé (différent du ps_customersignin par défaut), cette option peut ne pas fonctionner correctement.
it_it: Nota: se il tuo tema utilizza un template di accesso personalizzato (diverso dal ps_customersignin predefinito), questa opzione potrebbe non funzionare come previsto.
pl_pl: Uwaga: Jeśli Twój motyw używa własnego szablonu logowania (nie domyślnego ps_customersignin), ta opcja może nie działać zgodnie z oczekiwaniami.

source: Max codes per hour must be between 1 and 20.
fr_fr: Le nombre maximum de codes par heure doit être compris entre 1 et 20.

source: Resend countdown must be between 10 and 300 seconds.
fr_fr: Le délai de renvoi doit être compris entre 10 et 300 secondes.
